using System;
using System.Runtime.InteropServices;
using System.Collections.Generic;
using System.Linq;
using Utilities;

namespace BNet
{
	public abstract class BinFile<T> where T : struct
	{
		public abstract IEnumerable<T> Entries { get; set; }
		public abstract IEnumerable<ITableRow> ToTable();
	}

	#region flags
	[Flags]
	public enum ItemStatCostFlags
	{
		None = 0x0,
		sendOther = 0x1,
		signed = 0x2,
		damagerelated = 0x4,
		itemspecific = 0x8,
		direct = 0x10,
		updateanimrate = 0x200,
		fmin = 0x400,
		fcallback = 0x800,
		saved = 0x1000,
		csvsigned = 0x2000,
	}

	[Flags]
	public enum MonstatsFlags : uint
	{
		isSpawn			= 0x0,
		isMelee			= 0x1,
		noRatio			= 0x2,
		opendoors		= 0x4,
		SetBoss			= 0x8,
		BossXfer		= 0x10,
		boss			= 0x20,
		primeevil		= 0x40,
		npc				= 0x80,
		interact		= 0x100,
		inTown			= 0x200,
		lUndead			= 0x400,
		hUndead			= 0x800,
		demon			= 0x1000,
		flying			= 0x2000,
		killable		= 0x4000,
		switchai		= 0x8000,
		nomultishot		= 0x10000,
		neverCount		= 0x20000,
		petIgnore		= 0x40000,
		deathDmg		= 0x80000,
		genericSpawn	= 0x100000,
		zoo				= 0x200000,
		placespawn		= 0x400000,
		inventory		= 0x800000,
		enabled			= 0x1000000,
		NoShldBlock		= 0x2000000,
		noaura			= 0x4000000,
		rangedtype		= 0x8000000,
	}

	[Flags]
	public enum SkillsFlags1
	{
		decquant		= 0x0,
		lob				= 0x1,
		progressive		= 0x2,
		finishing		= 0x4,
		passive			= 0x8,
		aura			= 0x10,
		periodic		= 0x20,
		prgstack		= 0x40,
		InTown			= 0x80,
		Kick			= 0x100,

	public enum SkillsFlags2
	{
		TgtPlaceCheck		= 0x0,
		ItemCheckStart		= 0x1,
		ItemCltCheckStart	= 0x2,
		general				= 0x4,
		scroll				= 0x8,
		usemanaondo			= 0x10,
		warp				= 0x20,
	}

	[Flags]
	public enum MissilesFlags
	{
		LastCollide		= 0x0,
		Explosion		= 0x1,
		Pierce			= 0x2,
		CanSlow			= 0x4,
		CanDestroy		= 0x8,
		ClientSend		= 0x10,
		GetHit			= 0x20,
		SoftHit			= 0x40,
		ApplyMastery	= 0x80,
		ReturnFire		= 0x100,
		Town			= 0x200,
		SrcTown			= 0x400,
		NoMultiShot		= 0x800,
		NoUniqueMod		= 0x1000,
		Half2HSrc		= 0x2000,
		MissileSkill	= 0x4000,
	}

	[Flags]
	public enum Monstats2Flags1
	{
		noGfxHitTest	= 0x0,
		noMap			= 0x1,
		noOvly			= 0x2,
		isSel			= 0x4,
		alSel			= 0x8,
		noSel			= 0x10,
		shiftSel		= 0x20,
		corpseSel		= 0x40,
		revive			= 0x80,
		isAtt			= 0x100,
		small			= 0x200,
		large			= 0x400,
		soft			= 0x800,
		critter			= 0x1000,
		shadow			= 0x2000,
		noUniqueShift	= 0x4000,
		compositeDeath	= 0x8000,
		inert			= 0x10000,
		objCol			= 0x20000,
		deadCol			= 0x40000,
		unflatDead		= 0x80000,
	}

	[Flags]
	public enum Monstats2Flags2
	{
		HD		= 0x0,
		TR		= 0x1,
		LG		= 0x2,
		RA		= 0x4,
		LA		= 0x8,
		RH		= 0x10,
		LH		= 0x20,
		SH		= 0x40,
		S1		= 0x80,
		S2		= 0x100,
		S3		= 0x200,
		S4		= 0x400,
		S5		= 0x800,
		S6		= 0x1000,
		S7		= 0x2000,
		S8		= 0x4000,
	}

	[Flags]
	public enum Monstats2Flags3
	{
		mDT		= 0x0,
		mNU		= 0x1,
		mWL		= 0x2,
		mGH		= 0x4,
		mA1		= 0x8,
		mA2		= 0x10,
		mBL		= 0x20,
		mSC		= 0x40,
		mS1		= 0x80,
		mS2		= 0x100,
		mS3		= 0x200,
		mS4		= 0x400,
		mDD		= 0x800,
		mKB		= 0x1000,
		mSQ		= 0x2000,
		mRN		= 0x4000,
	}

	[Flags]
	public enum Monstats2Flags4
	{
		A1mv	= 0x0,
		A2mv	= 0x1,
		SCmv	= 0x2,
		S1mv	= 0x4,
		S2mv	= 0x8,
		S3mv	= 0x10,
		S4mv	= 0x20,
	}

	[Flags]
	public enum UniqueItemsFlags
	{
		enabled = 0x0,
		nolimit = 0x1,
		carry1 = 0x2,
		ladder = 0x4,
	}

	[Flags]
	public enum CubeItemFlags : byte
	{
		inputItemItemCodeFlag = 0x0,
		inputItemItemClassFlag = 0x1,
		inputItemAnyFlag = 0x2,
		inputItemSocketFlag = 0x4,
		inputItemNoEtherealFlag = 0x8,
		inputItemRepairFlag = 0x10,
		inputItemUniqueItemNameFlag = 0x20,
		inputItemUpgFlag = 0x40,
	}

	[Flags]
	public enum PetTypeFlags
	{
		warp = 0x0,
		range = 0x1,
		partysend = 0x2,
		unsummon = 0x4,
		automap = 0x8,
		drawhp = 0x10,
	}
	#endregion

	#region tested
	public class ItemStatCostTable
	{
		public List<ItemStatCostEntry> entries = new List<ItemStatCostEntry>();
		public IEnumerable<ItemStatCostEntry> Entries { get { return entries; } }

		public ItemStatCostTable(byte[] bytes)
		{
			uint count = BitConverter.ToUInt32(bytes, 0);
			bytes = bytes.Skip(4).ToArray();
			int size = Marshal.SizeOf(typeof(ItemStatCostEntry));
			for(uint i = 0; i < count; i++)
			{
				var bits = bytes.Take(size).ToArray();
				entries.Add(bits.PinAndCast<ItemStatCostEntry>());
				bytes = bytes.Skip(size).ToArray();
			}
		}

		[StructLayout(LayoutKind.Explicit)]
		public struct ItemStatCostEntry
		{
			[FieldOffset(0x0)] public short stat;
			[FieldOffset(0x4)] public ItemStatCostFlags flags;
			[FieldOffset(0x8)] public byte sendBits;
			[FieldOffset(0x9)] public byte sendParamBits;
			[FieldOffset(0xa)] public byte csvbits;
			[FieldOffset(0xb)] public byte csvparam;
			[FieldOffset(0xc)] public uint divide;
			[FieldOffset(0x10)] public uint multiply;
			[FieldOffset(0x14)] public uint add;
			[FieldOffset(0x18)] public byte valshift;
			[FieldOffset(0x19)] public byte saveBits;
			[FieldOffset(0x1a)] public byte _1_09_saveBits;
			[FieldOffset(0x1c)] public uint saveAdd;
			[FieldOffset(0x20)] public uint _1_09_saveAdd;
			[FieldOffset(0x24)] public uint saveParamBits;
			[FieldOffset(0x2c)] public uint minaccr;
			[FieldOffset(0x30)] public byte encode;
			[FieldOffset(0x32)] public short maxstat;
			[FieldOffset(0x34)] public short descpriority;
			[FieldOffset(0x36)] public byte descfunc;
			[FieldOffset(0x37)] public byte descval;
			[FieldOffset(0x38)] public short descstrpos;
			[FieldOffset(0x3a)] public short descstrneg;
			[FieldOffset(0x3c)] public short descstr2;
			[FieldOffset(0x3e)] public short dgrp;
			[FieldOffset(0x40)] public byte dgrpfunc;
			[FieldOffset(0x41)] public byte dgrpval;
			[FieldOffset(0x42)] public short dgrpstrpos;
			[FieldOffset(0x44)] public short dgrpstrneg;
			[FieldOffset(0x46)] public short dgrpstr2;
			[FieldOffset(0x48)] public short itemevent1;
			[FieldOffset(0x4a)] public short itemevent2;
			[FieldOffset(0x4c)] public short itemeventfunc1;
			[FieldOffset(0x4e)] public short itemeventfunc2;
			[FieldOffset(0x50)] public byte keepzero;
			[FieldOffset(0x54)] public byte op;
			[FieldOffset(0x55)] public byte opParam;
			[FieldOffset(0x56)] public short opBase;
			[FieldOffset(0x58)] public short opStat1;
			[FieldOffset(0x5a)] public short opStat2;
			[FieldOffset(0x5c)] public short opStat3;
			[FieldOffset(0x140)] public uint stuff;
		}
	}

	public class ExperienceTable
	{
		public LevelEntry MaxLevels;

		public List<LevelEntry> entries = new List<LevelEntry>();
		public IEnumerable<LevelEntry> Level { get { return entries; } }

		public ExperienceTable(byte[] bytes)
		{
			uint count = BitConverter.ToUInt32(bytes, 0)-1;
			bytes = bytes.Skip(4).ToArray();
			int size = Marshal.SizeOf(typeof(LevelEntry));

			var maxlevels = bytes.Take(size).ToArray();
			MaxLevels = maxlevels.PinAndCast<LevelEntry>();
			bytes = bytes.Skip(size).ToArray();

			for(uint i = 0; i < count; i++)
			{
				var bits = bytes.Take(size).ToArray();
				entries.Add(bits.PinAndCast<LevelEntry>());
				bytes = bytes.Skip(size).ToArray();
			}
		}

		[StructLayout(LayoutKind.Sequential)]
		public struct LevelEntry
		{
			public uint Amazon;
			public uint Sorceress;
			public uint Necromancer;
			public uint Paladin;
			public uint Barbarian;
			public uint Druid;
			public uint Assassin;
			public uint ExpRatio;
		}
	}

	public class ItemTable
	{
		public ItemTable(byte[] bytes)
		{
			uint count = BitConverter.ToUInt32(bytes, 0);
			int size = Marshal.SizeOf(typeof(ItemEntry));
			bytes = bytes.Skip(4).ToArray();
			for(uint i = 0; i < count; i++)
			{
				var bits = bytes.Take(size).ToArray();
				items.Add(bits.PinAndCast<ItemEntry>());
				bytes = bytes.Skip(size).ToArray();
			}
		}

		private List<ItemEntry> items = new List<ItemEntry>();
		public IEnumerable<ItemEntry> Items { get { return items; } }

		[StructLayout(LayoutKind.Sequential, CharSet = CharSet.Ansi, Pack = 1)]
		public struct ItemEntry
		{
			[MarshalAs(UnmanagedType.ByValTStr, SizeConst = 0x20)]
			public string flippyfile; // type: DATA_ASCII length: 0x1f offset: 0x0
			[MarshalAs(UnmanagedType.ByValTStr, SizeConst = 0x20)]
			public string invfile; // type: DATA_ASCII length: 0x1f offset: 0x20
			[MarshalAs(UnmanagedType.ByValTStr, SizeConst = 0x20)]
			public string uniqueinvfile; // type: DATA_ASCII length: 0x1f offset: 0x40
			[MarshalAs(UnmanagedType.ByValTStr, SizeConst = 0x20)]
			public string setinvfile; // type: DATA_ASCII length: 0x1f offset: 0x60
			public uint code; // type: ASCII_TO_CODE length: 0x0 offset: 0x80
			public uint normcode; // type: DATA_RAW length: 0x0 offset: 0x84
			public uint ubercode; // type: DATA_RAW length: 0x0 offset: 0x88
			public uint ultracode; // type: DATA_RAW length: 0x0 offset: 0x8c
			public uint alternategfx; // type: DATA_RAW length: 0x0 offset: 0x90
			public uint pSpell; // type: DATA_DWORD length: 0x0 offset: 0x94
			public short state; // type: NAME_TO_WORD length: 0x0 offset: 0x98
			public short cstate1; // type: NAME_TO_WORD length: 0x0 offset: 0x9a
			public short cstate2; // type: NAME_TO_WORD length: 0x0 offset: 0x9c
			public short stat1; // type: NAME_TO_WORD length: 0x0 offset: 0x9e
			public short stat2; // type: NAME_TO_WORD length: 0x0 offset: 0xa0
			public short stat3; // type: NAME_TO_WORD length: 0x0 offset: 0xa2
			public uint calc1; // type: CALC_TO_DWORD length: 0x0 offset: 0xa4
			public uint calc2; // type: CALC_TO_DWORD length: 0x0 offset: 0xa8
			public uint calc3; // type: CALC_TO_DWORD length: 0x0 offset: 0xac
			public uint len; // type: CALC_TO_DWORD length: 0x0 offset: 0xb0
			public short spelldesc; // type: DATA_BYTE length: 0x0 offset: 0xb4
			public short spelldescstr; // type: KEY_TO_WORD length: 0x0 offset: 0xb6
			public uint spelldesccalc; // type: CALC_TO_DWORD length: 0x0 offset: 0xb8
			public uint BetterGem; // type: DATA_RAW length: 0x0 offset: 0xbc
			public uint wclass; // type: DATA_RAW length: 0x0 offset: 0xc0
			public uint twohandedwclass; // type: DATA_RAW length: 0x0 offset: 0xc4
			public uint TMogType; // type: DATA_RAW length: 0x0 offset: 0xc8
			public uint minac; // type: DATA_DWORD length: 0x0 offset: 0xcc
			public uint maxac; // type: DATA_DWORD length: 0x0 offset: 0xd0
			public uint gambleCost; // type: DATA_DWORD length: 0x0 offset: 0xd4
			public uint speed; // type: DATA_DWORD_2 length: 0x0 offset: 0xd8
			public uint bitfield1; // type: DATA_DWORD length: 0x0 offset: 0xdc
			public uint cost; // type: DATA_DWORD length: 0x0 offset: 0xe0
			public uint minstack; // type: DATA_DWORD length: 0x0 offset: 0xe4
			public uint maxstack; // type: DATA_DWORD length: 0x0 offset: 0xe8
			public uint spawnstack; // type: DATA_DWORD length: 0x0 offset: 0xec
			public uint gemoffset; // type: DATA_DWORD_2 length: 0x0 offset: 0xf0
			public short namestr; // type: KEY_TO_WORD length: 0x0 offset: 0xf4
			public short version; // type: DATA_WORD length: 0x0 offset: 0xf6
			public short autoPrefix; // type: DATA_WORD length: 0x0 offset: 0xf8
			public short missiletype; // type: DATA_WORD length: 0x0 offset: 0xfa
			public byte rarity; // type: DATA_BYTE length: 0x0 offset: 0xfc
			public byte level; // type: DATA_BYTE length: 0x0 offset: 0xfd
			public byte mindam; // type: DATA_BYTE_2 length: 0x0 offset: 0xfe
			public byte maxdam; // type: DATA_BYTE_2 length: 0x0 offset: 0xff
			public byte minmisdam; // type: DATA_BYTE length: 0x0 offset: 0x100
			public byte maxmisdam; // type: DATA_BYTE length: 0x0 offset: 0x101
			public byte twohandmindam; // type: DATA_BYTE_2 length: 0x0 offset: 0x102
			public byte twohandmaxdam; // type: DATA_BYTE_2 length: 0x0 offset: 0x103
			public byte rangeadder; // type: DATA_BYTE_2 length: 0x0 offset: 0x104
			public short strbonus; // type: DATA_WORD length: 0x0 offset: 0x106
			public short dexbonus; // type: DATA_WORD length: 0x0 offset: 0x108
			public short reqstr; // type: DATA_WORD length: 0x0 offset: 0x10a
			public short reqdex; // type: DATA_WORD length: 0x0 offset: 0x10c
			public byte absorbs; // type: DATA_BYTE_2 length: 0x0 offset: 0x10e
			public byte invwidth; // type: DATA_BYTE length: 0x0 offset: 0x10f
			public byte invheight; // type: DATA_BYTE length: 0x0 offset: 0x110
			public byte block; // type: DATA_BYTE_2 length: 0x0 offset: 0x111
			public byte durability; // type: DATA_BYTE_2 length: 0x0 offset: 0x112
			public byte nodurability; // type: DATA_BYTE length: 0x0 offset: 0x113
			public byte missile; // type: DATA_BYTE_2 length: 0x0 offset: 0x114
			public byte component; // type: DATA_BYTE length: 0x0 offset: 0x115
			public byte rArm; // type: DATA_BYTE_2 length: 0x0 offset: 0x116
			public byte lArm; // type: DATA_BYTE_2 length: 0x0 offset: 0x117
			public byte torso; // type: DATA_BYTE_2 length: 0x0 offset: 0x118
			public byte legs; // type: DATA_BYTE_2 length: 0x0 offset: 0x119
			public byte rspad; // type: DATA_BYTE_2 length: 0x0 offset: 0x11a
			public byte lspad; // type: DATA_BYTE_2 length: 0x0 offset: 0x11b
			public byte twohanded; // type: DATA_BYTE_2 length: 0x0 offset: 0x11c
			public byte useable; // type: DATA_BYTE length: 0x0 offset: 0x11d
			public short type; // type: CODE_TO_WORD length: 0x0 offset: 0x11e
			public short type2; // type: CODE_TO_WORD length: 0x0 offset: 0x120
			public byte subtype; // type: DATA_BYTE_2 length: 0x0 offset: 0x122
			public short dropsound; // type: NAME_TO_WORD length: 0x0 offset: 0x124
			public short usesound; // type: NAME_TO_WORD length: 0x0 offset: 0x126
			public byte dropsfxframe; // type: DATA_BYTE length: 0x0 offset: 0x128
			public byte unique; // type: DATA_BYTE length: 0x0 offset: 0x129
			public byte quest; // type: DATA_BYTE length: 0x0 offset: 0x12a
			public byte questdiffcheck; // type: DATA_BYTE length: 0x0 offset: 0x12b
			public byte transparent; // type: DATA_BYTE length: 0x0 offset: 0x12c
			public byte transtbl; // type: DATA_BYTE length: 0x0 offset: 0x12d
			public byte lightradius; // type: DATA_BYTE length: 0x0 offset: 0x12f
			public byte belt; // type: DATA_BYTE length: 0x0 offset: 0x130
			public byte autobelt; // type: DATA_BYTE length: 0x0 offset: 0x131
			public byte stackable; // type: DATA_BYTE length: 0x0 offset: 0x132
			public byte spawnable; // type: DATA_BYTE length: 0x0 offset: 0x133
			public byte spellicon; // type: DATA_BYTE_2 length: 0x0 offset: 0x134
			public byte durwarning; // type: DATA_BYTE length: 0x0 offset: 0x135
			public byte qntwarning; // type: DATA_BYTE length: 0x0 offset: 0x136
			public byte hasinv; // type: DATA_BYTE_2 length: 0x0 offset: 0x137
			public byte gemsockets; // type: DATA_BYTE_2 length: 0x0 offset: 0x138
			public byte Transmogrify; // type: DATA_BYTE_2 length: 0x0 offset: 0x139
			public byte TMogMin; // type: DATA_BYTE_2 length: 0x0 offset: 0x13a
			public byte TMogMax; // type: DATA_BYTE_2 length: 0x0 offset: 0x13b
			public byte hitClass; // type: CODE_TO_BYTE length: 0x0 offset: 0x13c
			public byte oneortwohanded; // type: DATA_BYTE_2 length: 0x0 offset: 0x13d
			public byte gemapplytype; // type: DATA_BYTE length: 0x0 offset: 0x13e
			public byte levelreq; // type: DATA_BYTE length: 0x0 offset: 0x13f
			public byte magicLvl; // type: DATA_BYTE length: 0x0 offset: 0x140
			public byte Transform; // type: DATA_BYTE length: 0x0 offset: 0x141
			public byte InvTrans; // type: DATA_BYTE length: 0x0 offset: 0x142
			public byte compactsave; // type: DATA_BYTE_2 length: 0x0 offset: 0x143
			public byte SkipName; // type: DATA_BYTE length: 0x0 offset: 0x144
			public byte Nameable; // type: DATA_BYTE length: 0x0 offset: 0x145
			public byte AkaraMin; // type: DATA_BYTE length: 0x0 offset: 0x146
			public byte GheedMin; // type: DATA_BYTE length: 0x0 offset: 0x147
			public byte CharsiMin; // type: DATA_BYTE length: 0x0 offset: 0x148
			public byte FaraMin; // type: DATA_BYTE length: 0x0 offset: 0x149
			public byte LysanderMin; // type: DATA_BYTE length: 0x0 offset: 0x14a
			public byte DrognanMin; // type: DATA_BYTE length: 0x0 offset: 0x14b
			public byte HraltiMin; // type: DATA_BYTE length: 0x0 offset: 0x14c
			public byte AlkorMin; // type: DATA_BYTE length: 0x0 offset: 0x14d
			public byte OrmusMin; // type: DATA_BYTE length: 0x0 offset: 0x14e
			public byte ElzixMin; // type: DATA_BYTE length: 0x0 offset: 0x14f
			public byte AshearaMin; // type: DATA_BYTE length: 0x0 offset: 0x150
			public byte CainMin; // type: DATA_BYTE length: 0x0 offset: 0x151
			public byte HalbuMin; // type: DATA_BYTE length: 0x0 offset: 0x152
			public byte JamellaMin; // type: DATA_BYTE length: 0x0 offset: 0x153
			public byte MalahMin; // type: DATA_BYTE length: 0x0 offset: 0x154
			public byte LarzukMin; // type: DATA_BYTE length: 0x0 offset: 0x155
			public byte DrehyaMin; // type: DATA_BYTE length: 0x0 offset: 0x156
			public byte AkaraMax; // type: DATA_BYTE length: 0x0 offset: 0x157
			public byte GheedMax; // type: DATA_BYTE length: 0x0 offset: 0x158
			public byte CharsiMax; // type: DATA_BYTE length: 0x0 offset: 0x159
			public byte FaraMax; // type: DATA_BYTE length: 0x0 offset: 0x15a
			public byte LysanderMax; // type: DATA_BYTE length: 0x0 offset: 0x15b
			public byte DrognanMax; // type: DATA_BYTE length: 0x0 offset: 0x15c
			public byte HraltiMax; // type: DATA_BYTE length: 0x0 offset: 0x15d
			public byte AlkorMax; // type: DATA_BYTE length: 0x0 offset: 0x15e
			public byte OrmusMax; // type: DATA_BYTE length: 0x0 offset: 0x15f
			public byte ElzixMax; // type: DATA_BYTE length: 0x0 offset: 0x160
			public byte AshearaMax; // type: DATA_BYTE length: 0x0 offset: 0x161
			public byte CainMax; // type: DATA_BYTE length: 0x0 offset: 0x162
			public byte HalbuMax; // type: DATA_BYTE length: 0x0 offset: 0x163
			public byte JamellaMax; // type: DATA_BYTE length: 0x0 offset: 0x164
			public byte MalahMax; // type: DATA_BYTE length: 0x0 offset: 0x165
			public byte LarzukMax; // type: DATA_BYTE length: 0x0 offset: 0x166
			public byte DrehyaMax; // type: DATA_BYTE length: 0x0 offset: 0x167
			public byte AkaraMagicMin; // type: DATA_BYTE length: 0x0 offset: 0x168
			public byte GheedMagicMin; // type: DATA_BYTE length: 0x0 offset: 0x169
			public byte CharsiMagicMin; // type: DATA_BYTE length: 0x0 offset: 0x16a
			public byte FaraMagicMin; // type: DATA_BYTE length: 0x0 offset: 0x16b
			public byte LysanderMagicMin; // type: DATA_BYTE length: 0x0 offset: 0x16c
			public byte DrognanMagicMin; // type: DATA_BYTE length: 0x0 offset: 0x16d
			public byte HraltiMagicMin; // type: DATA_BYTE length: 0x0 offset: 0x16e
			public byte AlkorMagicMin; // type: DATA_BYTE length: 0x0 offset: 0x16f
			public byte OrmusMagicMin; // type: DATA_BYTE length: 0x0 offset: 0x170
			public byte ElzixMagicMin; // type: DATA_BYTE length: 0x0 offset: 0x171
			public byte AshearaMagicMin; // type: DATA_BYTE length: 0x0 offset: 0x172
			public byte CainMagicMin; // type: DATA_BYTE length: 0x0 offset: 0x173
			public byte HalbuMagicMin; // type: DATA_BYTE length: 0x0 offset: 0x174
			public byte JamellaMagicMin; // type: DATA_BYTE length: 0x0 offset: 0x175
			public byte MalahMagicMin; // type: DATA_BYTE length: 0x0 offset: 0x176
			public byte LarzukMagicMin; // type: DATA_BYTE length: 0x0 offset: 0x177
			public byte DrehyaMagicMin; // type: DATA_BYTE length: 0x0 offset: 0x178
			public byte AkaraMagicMax; // type: DATA_BYTE length: 0x0 offset: 0x179
			public byte GheedMagicMax; // type: DATA_BYTE length: 0x0 offset: 0x17a
			public byte CharsiMagicMax; // type: DATA_BYTE length: 0x0 offset: 0x17b
			public byte FaraMagicMax; // type: DATA_BYTE length: 0x0 offset: 0x17c
			public byte LysanderMagicMax; // type: DATA_BYTE length: 0x0 offset: 0x17d
			public byte DrognanMagicMax; // type: DATA_BYTE length: 0x0 offset: 0x17e
			public byte HraltiMagicMax; // type: DATA_BYTE length: 0x0 offset: 0x17f
			public byte AlkorMagicMax; // type: DATA_BYTE length: 0x0 offset: 0x180
			public byte OrmusMagicMax; // type: DATA_BYTE length: 0x0 offset: 0x181
			public byte ElzixMagicMax; // type: DATA_BYTE length: 0x0 offset: 0x182
			public byte AshearaMagicMax; // type: DATA_BYTE length: 0x0 offset: 0x183
			public byte CainMagicMax; // type: DATA_BYTE length: 0x0 offset: 0x184
			public byte HalbuMagicMax; // type: DATA_BYTE length: 0x0 offset: 0x185
			public byte JamellaMagicMax; // type: DATA_BYTE length: 0x0 offset: 0x186
			public byte MalahMagicMax; // type: DATA_BYTE length: 0x0 offset: 0x187
			public byte LarzukMagicMax; // type: DATA_BYTE length: 0x0 offset: 0x188
			public byte DrehyaMagicMax; // type: DATA_BYTE length: 0x0 offset: 0x189
			public byte AkaraMagicLvl; // type: DATA_BYTE length: 0x0 offset: 0x18a
			public byte GheedMagicLvl; // type: DATA_BYTE length: 0x0 offset: 0x18b
			public byte CharsiMagicLvl; // type: DATA_BYTE length: 0x0 offset: 0x18c
			public byte FaraMagicLvl; // type: DATA_BYTE length: 0x0 offset: 0x18d
			public byte LysanderMagicLvl; // type: DATA_BYTE length: 0x0 offset: 0x18e
			public byte DrognanMagicLvl; // type: DATA_BYTE length: 0x0 offset: 0x18f
			public byte HraltiMagicLvl; // type: DATA_BYTE length: 0x0 offset: 0x190
			public byte AlkorMagicLvl; // type: DATA_BYTE length: 0x0 offset: 0x191
			public byte OrmusMagicLvl; // type: DATA_BYTE length: 0x0 offset: 0x192
			public byte ElzixMagicLvl; // type: DATA_BYTE length: 0x0 offset: 0x193
			public byte AshearaMagicLvl; // type: DATA_BYTE length: 0x0 offset: 0x194
			public byte CainMagicLvl; // type: DATA_BYTE length: 0x0 offset: 0x195
			public byte HalbuMagicLvl; // type: DATA_BYTE length: 0x0 offset: 0x196
			public byte JamellaMagicLvl; // type: DATA_BYTE length: 0x0 offset: 0x197
			public byte MalahMagicLvl; // type: DATA_BYTE length: 0x0 offset: 0x198
			public byte LarzukMagicLvl; // type: DATA_BYTE length: 0x0 offset: 0x199
			public byte DrehyaMagicLvl; // type: DATA_BYTE length: 0x0 offset: 0x19a
			public uint NightmareUpgrade; // type: DATA_RAW length: 0x0 offset: 0x19c
			public uint HellUpgrade; // type: DATA_RAW length: 0x0 offset: 0x1a0
			public byte PermStoreItem; // type: DATA_BYTE length: 0x0 offset: 0x1a4
			public byte multibuy; // type: DATA_BYTE length: 0x0 offset: 0x1a5
			public uint unk1;
			public ushort unk2;
		}
	}

	public class CubemainTable
	{
		public List<CubemainEntry> entries = new List<CubemainEntry>();
		public IEnumerable<CubemainEntry> Entries { get { return entries; } }

		public CubemainTable(byte[] bytes)
		{
			uint count = BitConverter.ToUInt32(bytes, 0);
			bytes = bytes.Skip(4).ToArray();
			int size = Marshal.SizeOf(typeof(CubemainEntry));
			for(uint i = 0; i < count; i++)
			{
				var bits = bytes.Take(size).ToArray();
				entries.Add(bits.PinAndCast<CubemainEntry>());
				bytes = bytes.Skip(size).ToArray();
			}
		}

		[StructLayout(LayoutKind.Explicit)]
		public struct CubemainEntry
		{
			[FieldOffset(0x0)] byte enabled; // type: DATA_BYTE length: 0x0 offset: 0x0
			[FieldOffset(0x1)] byte ladder; // type: DATA_BYTE length: 0x0 offset: 0x1
			[FieldOffset(0x2)] byte minDiff; // type: DATA_BYTE length: 0x0 offset: 0x2
			[FieldOffset(0x3)] byte Class; // type: CODE_TO_BYTE length: 0x0 offset: 0x3
			[FieldOffset(0x4)] byte op; // type: DATA_BYTE length: 0x0 offset: 0x4
			[FieldOffset(0x8)] uint param; // type: DATA_DWORD length: 0x0 offset: 0x8
			[FieldOffset(0xc)] uint value; // type: DATA_DWORD length: 0x0 offset: 0xc
			[FieldOffset(0x10)] byte numinputs; // type: DATA_BYTE length: 0x0 offset: 0x10
			[FieldOffset(0x12)] short version; // type: DATA_WORD length: 0x0 offset: 0x12
			[FieldOffset(0x14)] CubeItemFlags item1;
			[FieldOffset(0x15)] byte input1ItemType; // type: DATA_BYTE length: 0x0 offset: 0x15
			[FieldOffset(0x16)] byte input1Item; // type: DATA_BYTE length: 0x0 offset: 0x16
			[FieldOffset(0x18)] byte input1ItemId; // type: DATA_BYTE length: 0x0 offset: 0x18
			[FieldOffset(0x1a)] byte input1Quality; // type: DATA_BYTE length: 0x0 offset: 0x1a
			[FieldOffset(0x1b)] byte input1Quantity; // type: DATA_BYTE length: 0x0 offset: 0x1b
			[FieldOffset(0x1c)] CubeItemFlags item2;
			[FieldOffset(0x1d)] byte input2itemtype; // type: DATA_BYTE length: 0x0 offset: 0x1d
			[FieldOffset(0x1e)] byte input2item; // type: DATA_BYTE length: 0x0 offset: 0x1e
			[FieldOffset(0x20)] byte input2itemid; // type: DATA_BYTE length: 0x0 offset: 0x20
			[FieldOffset(0x22)] byte input2quality; // type: DATA_BYTE length: 0x0 offset: 0x22
			[FieldOffset(0x23)] byte input2quantity; // type: DATA_BYTE length: 0x0 offset: 0x23
			[FieldOffset(0x24)] CubeItemFlags item3;
			[FieldOffset(0x25)] byte input3itemtype; // type: DATA_BYTE length: 0x0 offset: 0x25
			[FieldOffset(0x26)] byte input3item; // type: DATA_BYTE length: 0x0 offset: 0x26
			[FieldOffset(0x27)] byte input3itemid; // type: DATA_BYTE length: 0x0 offset: 0x28
			[FieldOffset(0x2a)] byte input3quality; // type: DATA_BYTE length: 0x0 offset: 0x2a
			[FieldOffset(0x2b)] byte input3quantity; // type: DATA_BYTE length: 0x0 offset: 0x2b
			[FieldOffset(0x2c)] CubeItemFlags item4;
			[FieldOffset(0x2d)] byte input4itemtype; // type: DATA_BYTE length: 0x0 offset: 0x2d
			[FieldOffset(0x2e)] byte input4item; // type: DATA_BYTE length: 0x0 offset: 0x2e
			[FieldOffset(0x30)] byte input4itemid; // type: DATA_BYTE length: 0x0 offset: 0x30
			[FieldOffset(0x32)] byte input4quality; // type: DATA_BYTE length: 0x0 offset: 0x32
			[FieldOffset(0x33)] byte input4quantity; // type: DATA_BYTE length: 0x0 offset: 0x33
			[FieldOffset(0x34)] CubeItemFlags item5;
			[FieldOffset(0x35)] byte input5itemtype; // type: DATA_BYTE length: 0x0 offset: 0x35
			[FieldOffset(0x36)] byte input5item; // type: DATA_BYTE length: 0x0 offset: 0x36
			[FieldOffset(0x38)] byte input5itemid; // type: DATA_BYTE length: 0x0 offset: 0x38
			[FieldOffset(0x3a)] byte input5quality; // type: DATA_BYTE length: 0x0 offset: 0x3a
			[FieldOffset(0x3b)] byte input5quantity; // type: DATA_BYTE length: 0x0 offset: 0x3b
			[FieldOffset(0x3c)] CubeItemFlags item6;
			[FieldOffset(0x3d)] byte input6itemtype; // type: DATA_BYTE length: 0x0 offset: 0x3d
			[FieldOffset(0x3e)] byte input6item; // type: DATA_BYTE length: 0x0 offset: 0x3e
			[FieldOffset(0x40)] byte input6itemid; // type: DATA_BYTE length: 0x0 offset: 0x40
			[FieldOffset(0x42)] byte input6quality; // type: DATA_BYTE length: 0x0 offset: 0x42
			[FieldOffset(0x43)] byte input6quantity; // type: DATA_BYTE length: 0x0 offset: 0x43
			[FieldOffset(0x44)] CubeItemFlags item7;
			[FieldOffset(0x45)] byte input7itemtype; // type: DATA_BYTE length: 0x0 offset: 0x45
			[FieldOffset(0x46)] byte input7item; // type: DATA_BYTE length: 0x0 offset: 0x46
			[FieldOffset(0x48)] byte input7itemid; // type: DATA_BYTE length: 0x0 offset: 0x48
			[FieldOffset(0x4a)] byte input7quality; // type: DATA_BYTE length: 0x0 offset: 0x4a
			[FieldOffset(0x4b)] byte input7quantity; // type: DATA_BYTE length: 0x0 offset: 0x4b
			[FieldOffset(0x4c)] byte outputitemflags; // type: DATA_BYTE length: 0x0 offset: 0x4c
			[FieldOffset(0x4d)] byte outputitemtype; // type: DATA_BYTE length: 0x0 offset: 0x4d
			[FieldOffset(0x4e)] byte outputitem; // type: DATA_BYTE length: 0x0 offset: 0x4e
			[FieldOffset(0x50)] byte outputitemid; // type: DATA_BYTE length: 0x0 offset: 0x50
			[FieldOffset(0x52)] byte outputitemquality; // type: DATA_BYTE length: 0x0 offset: 0x52
			[FieldOffset(0x53)] byte outputitemquantity; // type: DATA_BYTE length: 0x0 offset: 0x53
			[FieldOffset(0x54)] byte outputtype; // type: DATA_BYTE length: 0x0 offset: 0x54
			[FieldOffset(0x55)] byte lvl; // type: DATA_BYTE length: 0x0 offset: 0x55
			[FieldOffset(0x56)] byte plvl; // type: DATA_BYTE length: 0x0 offset: 0x56
			[FieldOffset(0x57)] byte ilvl; // type: DATA_BYTE length: 0x0 offset: 0x57	
			[FieldOffset(0x58)] byte outputitemprefixid; // type: DATA_BYTE length: 0x0 offset: 0x58
			[FieldOffset(0x5a)] byte outputitemunknown; // type: DATA_BYTE length: 0x0 offset: 0x5a
			[FieldOffset(0x5e)] byte outputitemsuffixid; // type: DATA_BYTE length: 0x0 offset: 0x5e
			[FieldOffset(0x60)] byte unknownfield; // type: DATA_BYTE length: 0x0 offset: 0x60
			[FieldOffset(0x64)] uint mod1; // type: NAME_TO_DWORD length: 0x0 offset: 0x64
			[FieldOffset(0x68)] short mod1param; // type: DATA_WORD length: 0x0 offset: 0x68
			[FieldOffset(0x6a)] short mod1min; // type: DATA_WORD length: 0x0 offset: 0x6a
			[FieldOffset(0x6c)] short mod1max; // type: DATA_WORD length: 0x0 offset: 0x6c
			[FieldOffset(0x6e)] byte mod1chance; // type: DATA_BYTE length: 0x0 offset: 0x6e
			[FieldOffset(0x70)] uint mod2; // type: NAME_TO_DWORD length: 0x0 offset: 0x70
			[FieldOffset(0x74)] short mod2param; // type: DATA_WORD length: 0x0 offset: 0x74
			[FieldOffset(0x76)] short mod2min; // type: DATA_WORD length: 0x0 offset: 0x76
			[FieldOffset(0x78)] short mod2max; // type: DATA_WORD length: 0x0 offset: 0x78
			[FieldOffset(0x7a)] byte mod2chance; // type: DATA_BYTE length: 0x0 offset: 0x7a
			[FieldOffset(0x7c)] uint mod3; // type: NAME_TO_DWORD length: 0x0 offset: 0x7c
			[FieldOffset(0x80)] short mod3param; // type: DATA_WORD length: 0x0 offset: 0x80
			[FieldOffset(0x82)] short mod3min; // type: DATA_WORD length: 0x0 offset: 0x82
			[FieldOffset(0x84)] short mod3max; // type: DATA_WORD length: 0x0 offset: 0x84
			[FieldOffset(0x86)] byte mod3chance; // type: DATA_BYTE length: 0x0 offset: 0x86
			[FieldOffset(0x88)] uint mod4; // type: NAME_TO_DWORD length: 0x0 offset: 0x88
			[FieldOffset(0x8c)] short mod4param; // type: DATA_WORD length: 0x0 offset: 0x8c
			[FieldOffset(0x8e)] short mod4min; // type: DATA_WORD length: 0x0 offset: 0x8e
			[FieldOffset(0x90)] short mod4max; // type: DATA_WORD length: 0x0 offset: 0x90
			[FieldOffset(0x92)] byte mod4chance; // type: DATA_BYTE length: 0x0 offset: 0x92
			[FieldOffset(0x94)] uint mod5; // type: NAME_TO_DWORD length: 0x0 offset: 0x94
			[FieldOffset(0x98)] short mod5param; // type: DATA_WORD length: 0x0 offset: 0x98
			[FieldOffset(0x9a)] short mod5min; // type: DATA_WORD length: 0x0 offset: 0x9a
			[FieldOffset(0x9c)] short mod5max; // type: DATA_WORD length: 0x0 offset: 0x9c
			[FieldOffset(0x9e)] byte mod5chance; // type: DATA_BYTE length: 0x0 offset: 0x9e
			[FieldOffset(0xa9)] byte blvl; // type: DATA_BYTE length: 0x0 offset: 0xa9
			[FieldOffset(0xaa)] byte bplvl; // type: DATA_BYTE length: 0x0 offset: 0xaa
			[FieldOffset(0xab)] byte bilvl; // type: DATA_BYTE length: 0x0 offset: 0xab
			[FieldOffset(0xb8)] uint bmod1; // type: NAME_TO_DWORD length: 0x0 offset: 0xb8
			[FieldOffset(0xbc)] short bmod1param; // type: DATA_WORD length: 0x0 offset: 0xbc
			[FieldOffset(0xbe)] short bmod1min; // type: DATA_WORD length: 0x0 offset: 0xbe
			[FieldOffset(0xc0)] short bmod1max; // type: DATA_WORD length: 0x0 offset: 0xc0
			[FieldOffset(0xc2)] byte bmod1chance; // type: DATA_BYTE length: 0x0 offset: 0xc2
			[FieldOffset(0xc4)] uint bmod2; // type: NAME_TO_DWORD length: 0x0 offset: 0xc4
			[FieldOffset(0xc8)] short bmod2param; // type: DATA_WORD length: 0x0 offset: 0xc8
			[FieldOffset(0xca)] short bmod2min; // type: DATA_WORD length: 0x0 offset: 0xca
			[FieldOffset(0xcc)] short bmod2max; // type: DATA_WORD length: 0x0 offset: 0xcc
			[FieldOffset(0xce)] byte bmod2chance; // type: DATA_BYTE length: 0x0 offset: 0xce
			[FieldOffset(0xd0)] uint bmod3; // type: NAME_TO_DWORD length: 0x0 offset: 0xd0
			[FieldOffset(0xd4)] short bmod3param; // type: DATA_WORD length: 0x0 offset: 0xd4
			[FieldOffset(0xd6)] short bmod3min; // type: DATA_WORD length: 0x0 offset: 0xd6
			[FieldOffset(0xd8)] short bmod3max; // type: DATA_WORD length: 0x0 offset: 0xd8
			[FieldOffset(0xda)] byte bmod3chance; // type: DATA_BYTE length: 0x0 offset: 0xda
			[FieldOffset(0xdc)] uint bmod4; // type: NAME_TO_DWORD length: 0x0 offset: 0xdc
			[FieldOffset(0xe0)] short bmod4param; // type: DATA_WORD length: 0x0 offset: 0xe0
			[FieldOffset(0xe2)] short bmod4min; // type: DATA_WORD length: 0x0 offset: 0xe2
			[FieldOffset(0xe4)] short bmod4max; // type: DATA_WORD length: 0x0 offset: 0xe4
			[FieldOffset(0xe6)] byte bmod4chance; // type: DATA_BYTE length: 0x0 offset: 0xe6
			[FieldOffset(0xe8)] uint bmod5; // type: NAME_TO_DWORD length: 0x0 offset: 0xe8
			[FieldOffset(0xec)] short bmod5param; // type: DATA_WORD length: 0x0 offset: 0xec
			[FieldOffset(0xee)] short bmod5min; // type: DATA_WORD length: 0x0 offset: 0xee
			[FieldOffset(0xf0)] short bmod5max; // type: DATA_WORD length: 0x0 offset: 0xf0
			[FieldOffset(0xf2)] byte bmod5chance; // type: DATA_BYTE length: 0x0 offset: 0xf2
			[FieldOffset(0xfd)] byte clvl; // type: DATA_BYTE length: 0x0 offset: 0xfd
			[FieldOffset(0xfe)] byte cplvl; // type: DATA_BYTE length: 0x0 offset: 0xfe
			[FieldOffset(0xff)] byte cilvl; // type: DATA_BYTE length: 0x0 offset: 0xff
			[FieldOffset(0x10c)] uint cmod1; // type: NAME_TO_DWORD length: 0x0 offset: 0x10c
			[FieldOffset(0x110)] short cmod1param; // type: DATA_WORD length: 0x0 offset: 0x110
			[FieldOffset(0x112)] short cmod1min; // type: DATA_WORD length: 0x0 offset: 0x112
			[FieldOffset(0x114)] short cmod1max; // type: DATA_WORD length: 0x0 offset: 0x114
			[FieldOffset(0x116)] byte cmod1chance; // type: DATA_BYTE length: 0x0 offset: 0x116
			[FieldOffset(0x118)] uint cmod2; // type: NAME_TO_DWORD length: 0x0 offset: 0x118
			[FieldOffset(0x11c)] short cmod2param; // type: DATA_WORD length: 0x0 offset: 0x11c
			[FieldOffset(0x11e)] short cmod2min; // type: DATA_WORD length: 0x0 offset: 0x11e
			[FieldOffset(0x120)] short cmod2max; // type: DATA_WORD length: 0x0 offset: 0x120
			[FieldOffset(0x122)] byte cmod2chance; // type: DATA_BYTE length: 0x0 offset: 0x122
			[FieldOffset(0x124)] uint cmod3; // type: NAME_TO_DWORD length: 0x0 offset: 0x124
			[FieldOffset(0x148)] short cmod3param; // type: DATA_WORD length: 0x0 offset: 0x128
			[FieldOffset(0x12a)] short cmod3min; // type: DATA_WORD length: 0x0 offset: 0x12a
			[FieldOffset(0x12c)] short cmod3max; // type: DATA_WORD length: 0x0 offset: 0x12c
			[FieldOffset(0x12e)] byte cmod3chance; // type: DATA_BYTE length: 0x0 offset: 0x12e
			[FieldOffset(0x130)] uint cmod4; // type: NAME_TO_DWORD length: 0x0 offset: 0x130
			[FieldOffset(0x134)] short cmod4param; // type: DATA_WORD length: 0x0 offset: 0x134
			[FieldOffset(0x136)] short cmod4min; // type: DATA_WORD length: 0x0 offset: 0x136
			[FieldOffset(0x138)] short cmod4max; // type: DATA_WORD length: 0x0 offset: 0x138
			[FieldOffset(0x13a)] byte cmod4chance; // type: DATA_BYTE length: 0x0 offset: 0x13a
			[FieldOffset(0x13c)] uint cmod5; // type: NAME_TO_DWORD length: 0x0 offset: 0x13c
			[FieldOffset(0x140)] short cmod5param; // type: DATA_WORD length: 0x0 offset: 0x140
			[FieldOffset(0x142)] short cmod5min; // type: DATA_WORD length: 0x0 offset: 0x142
			[FieldOffset(0x144)] short cmod5max; // type: DATA_WORD length: 0x0 offset: 0x144
			[FieldOffset(0x146)] byte cmod5chance; // type: DATA_BYTE length: 0x0 offset: 0x146
			[FieldOffset(0x148)] byte end; // type: END length: 0x0 offset: 0x148
		}
	}

	public class MonstatsTable
	{
		private List<MonstatsEntry> entries = new List<MonstatsEntry>();
		public IEnumerable<MonstatsEntry> Entries { get { return entries; } }

		public MonstatsTable(byte[] bytes)
		{
			uint count = BitConverter.ToUInt32(bytes, 0);
			int size = Marshal.SizeOf(typeof(MonstatsEntry));
			bytes = bytes.Skip(4).ToArray();
			for(uint i = 0; i < count; i++)
			{
				var bits = bytes.Take(size).ToArray();
				entries.Add(bits.PinAndCast<MonstatsEntry>());
				bytes = bytes.Skip(size).ToArray();
			}
		}

		[StructLayout(LayoutKind.Explicit)]
		public struct MonstatsEntry
		{
			[FieldOffset(0x0)] short Id; // type: NAME_TO_INDEX length: 0x0 offset: 0x0
			[FieldOffset(0x2)] short BaseId; // type: NAME_TO_WORD length: 0x0 offset: 0x2
			[FieldOffset(0x4)] short NextInClass; // type: NAME_TO_WORD length: 0x0 offset: 0x4
			[FieldOffset(0x6)] short NameStr; // type: KEY_TO_WORD length: 0x0 offset: 0x6
			[FieldOffset(0x8)] short DescStr; // type: KEY_TO_WORD length: 0x0 offset: 0x8
			[FieldOffset(0xc)] MonstatsFlags flags;
			[FieldOffset(0x10)] uint Code; // type: DATA_RAW length: 0x0 offset: 0x10
			[FieldOffset(0x14)] short MonSound; // type: NAME_TO_WORD length: 0x0 offset: 0x14
			[FieldOffset(0x16)] short UMonSound; // type: NAME_TO_WORD length: 0x0 offset: 0x16
			[FieldOffset(0x18)] short MonStatsEx; // type: NAME_TO_WORD length: 0x0 offset: 0x18
			[FieldOffset(0x1a)] short MonProp; // type: NAME_TO_WORD length: 0x0 offset: 0x1a
			[FieldOffset(0x1c)] short MonType; // type: NAME_TO_WORD length: 0x0 offset: 0x1c
			[FieldOffset(0x1e)] short AI; // type: NAME_TO_WORD length: 0x0 offset: 0x1e
			[FieldOffset(0x20)] short spawn; // type: NAME_TO_WORD length: 0x0 offset: 0x20
			[FieldOffset(0x22)] byte spawnx; // type: DATA_BYTE length: 0x0 offset: 0x22
			[FieldOffset(0x23)] byte spawny; // type: DATA_BYTE length: 0x0 offset: 0x23
			[FieldOffset(0x24)] byte spawnmode; // type: CODE_TO_BYTE length: 0x0 offset: 0x24
			[FieldOffset(0x26)] short minion1; // type: NAME_TO_WORD length: 0x0 offset: 0x26
			[FieldOffset(0x28)] short minion2; // type: NAME_TO_WORD length: 0x0 offset: 0x28
			[FieldOffset(0x2c)] byte PartyMin; // type: DATA_BYTE length: 0x0 offset: 0x2c
			[FieldOffset(0x2d)] byte PartyMax; // type: DATA_BYTE length: 0x0 offset: 0x2d
			[FieldOffset(0x2e)] byte Rarity; // type: DATA_BYTE length: 0x0 offset: 0x2e
			[FieldOffset(0x2f)] byte MinGrp; // type: DATA_BYTE length: 0x0 offset: 0x2f
			[FieldOffset(0x30)] byte MaxGrp; // type: DATA_BYTE length: 0x0 offset: 0x30
			[FieldOffset(0x31)] byte sparsePopulate; // type: DATA_BYTE length: 0x0 offset: 0x31
			[FieldOffset(0x32)] short Velocity; // type: DATA_WORD length: 0x0 offset: 0x32
			[FieldOffset(0x34)] short Run; // type: DATA_WORD length: 0x0 offset: 0x34
			[FieldOffset(0x3a)] short MissA1; // type: NAME_TO_WORD length: 0x0 offset: 0x3a
			[FieldOffset(0x3c)] short MissA2; // type: NAME_TO_WORD length: 0x0 offset: 0x3c
			[FieldOffset(0x3e)] short MissS1; // type: NAME_TO_WORD length: 0x0 offset: 0x3e
			[FieldOffset(0x40)] short MissS2; // type: NAME_TO_WORD length: 0x0 offset: 0x40
			[FieldOffset(0x42)] short MissS3; // type: NAME_TO_WORD length: 0x0 offset: 0x42
			[FieldOffset(0x44)] short MissS4; // type: NAME_TO_WORD length: 0x0 offset: 0x44
			[FieldOffset(0x46)] short MissC; // type: NAME_TO_WORD length: 0x0 offset: 0x46
			[FieldOffset(0x48)] short MissSQ; // type: NAME_TO_WORD length: 0x0 offset: 0x48
			[FieldOffset(0x4c)] byte Align; // type: DATA_BYTE length: 0x0 offset: 0x4c
			[FieldOffset(0x4d)] byte TransLvl; // type: DATA_BYTE length: 0x0 offset: 0x4d
			[FieldOffset(0x4e)] byte threat; // type: DATA_BYTE length: 0x0 offset: 0x4e
			[FieldOffset(0x4f)] byte aidel; // type: DATA_BYTE length: 0x0 offset: 0x4f
			[FieldOffset(0x50)] byte aidelN; // type: DATA_BYTE length: 0x0 offset: 0x50
			[FieldOffset(0x51)] byte aidelH; // type: DATA_BYTE length: 0x0 offset: 0x51
			[FieldOffset(0x52)] byte aidist; // type: DATA_BYTE length: 0x0 offset: 0x52
			[FieldOffset(0x53)] byte aidistN; // type: DATA_BYTE length: 0x0 offset: 0x53
			[FieldOffset(0x54)] byte aidistH; // type: DATA_BYTE length: 0x0 offset: 0x54
			[FieldOffset(0x56)] short aip1; // type: DATA_WORD length: 0x0 offset: 0x56
			[FieldOffset(0x58)] short aip1N; // type: DATA_WORD length: 0x0 offset: 0x58
			[FieldOffset(0x5a)] short aip1H; // type: DATA_WORD length: 0x0 offset: 0x5a
			[FieldOffset(0x5c)] short aip2; // type: DATA_WORD length: 0x0 offset: 0x5c
			[FieldOffset(0x5e)] short aip2N; // type: DATA_WORD length: 0x0 offset: 0x5e
			[FieldOffset(0x60)] short aip2H; // type: DATA_WORD length: 0x0 offset: 0x60
			[FieldOffset(0x62)] short aip3; // type: DATA_WORD length: 0x0 offset: 0x62
			[FieldOffset(0x64)] short aip3N; // type: DATA_WORD length: 0x0 offset: 0x64
			[FieldOffset(0x66)] short aip3H; // type: DATA_WORD length: 0x0 offset: 0x66
			[FieldOffset(0x68)] short aip4; // type: DATA_WORD length: 0x0 offset: 0x68
			[FieldOffset(0x6a)] short aip4N; // type: DATA_WORD length: 0x0 offset: 0x6a
			[FieldOffset(0x6c)] short aip4H; // type: DATA_WORD length: 0x0 offset: 0x6c
			[FieldOffset(0x6e)] short aip5; // type: DATA_WORD length: 0x0 offset: 0x6e
			[FieldOffset(0x70)] short aip5N; // type: DATA_WORD length: 0x0 offset: 0x70
			[FieldOffset(0x72)] short aip5H; // type: DATA_WORD length: 0x0 offset: 0x72
			[FieldOffset(0x74)] short aip6; // type: DATA_WORD length: 0x0 offset: 0x74
			[FieldOffset(0x76)] short aip6N; // type: DATA_WORD length: 0x0 offset: 0x76
			[FieldOffset(0x78)] short aip6H; // type: DATA_WORD length: 0x0 offset: 0x78
			[FieldOffset(0x7a)] short aip7; // type: DATA_WORD length: 0x0 offset: 0x7a
			[FieldOffset(0x7c)] short aip7N; // type: DATA_WORD length: 0x0 offset: 0x7c
			[FieldOffset(0x7e)] short aip7H; // type: DATA_WORD length: 0x0 offset: 0x7e
			[FieldOffset(0x80)] short aip8; // type: DATA_WORD length: 0x0 offset: 0x80
			[FieldOffset(0x82)] short aip8N; // type: DATA_WORD length: 0x0 offset: 0x82
			[FieldOffset(0x84)] short aip8H; // type: DATA_WORD length: 0x0 offset: 0x84
			[FieldOffset(0x86)] short TreasureClass1; // type: NAME_TO_WORD length: 0x0 offset: 0x86
			[FieldOffset(0x88)] short TreasureClass2; // type: NAME_TO_WORD length: 0x0 offset: 0x88
			[FieldOffset(0x8a)] short TreasureClass3; // type: NAME_TO_WORD length: 0x0 offset: 0x8a
			[FieldOffset(0x8c)] short TreasureClass4; // type: NAME_TO_WORD length: 0x0 offset: 0x8c
			[FieldOffset(0x8e)] short TreasureClass1N; // type: NAME_TO_WORD length: 0x0 offset: 0x8e
			[FieldOffset(0x90)] short TreasureClass2N; // type: NAME_TO_WORD length: 0x0 offset: 0x90
			[FieldOffset(0x92)] short TreasureClass3N; // type: NAME_TO_WORD length: 0x0 offset: 0x92
			[FieldOffset(0x94)] short TreasureClass4N; // type: NAME_TO_WORD length: 0x0 offset: 0x94
			[FieldOffset(0x96)] short TreasureClass1H; // type: NAME_TO_WORD length: 0x0 offset: 0x96
			[FieldOffset(0x98)] short TreasureClass2H; // type: NAME_TO_WORD length: 0x0 offset: 0x98
			[FieldOffset(0x9a)] short TreasureClass3H; // type: NAME_TO_WORD length: 0x0 offset: 0x9a
			[FieldOffset(0x9c)] short TreasureClass4H; // type: NAME_TO_WORD length: 0x0 offset: 0x9c
			[FieldOffset(0x9e)] byte TCQuestId; // type: DATA_BYTE length: 0x0 offset: 0x9e
			[FieldOffset(0x9f)] byte TCQuestCP; // type: DATA_BYTE length: 0x0 offset: 0x9f
			[FieldOffset(0xa0)] byte Drain; // type: DATA_BYTE length: 0x0 offset: 0xa0
			[FieldOffset(0xa1)] byte DrainN; // type: DATA_BYTE length: 0x0 offset: 0xa1
			[FieldOffset(0xa2)] byte DrainH; // type: DATA_BYTE length: 0x0 offset: 0xa2
			[FieldOffset(0xa3)] byte ToBlock; // type: DATA_BYTE length: 0x0 offset: 0xa3
			[FieldOffset(0xa4)] byte ToBlockN; // type: DATA_BYTE length: 0x0 offset: 0xa4
			[FieldOffset(0xa5)] byte ToBlockH; // type: DATA_BYTE length: 0x0 offset: 0xa5
			[FieldOffset(0xa6)] byte Crit; // type: DATA_BYTE length: 0x0 offset: 0xa6
			[FieldOffset(0xa8)] short SkillDamage; // type: NAME_TO_WORD length: 0x0 offset: 0xa8
			[FieldOffset(0xaa)] short Level; // type: DATA_WORD length: 0x0 offset: 0xaa
			[FieldOffset(0xac)] short LevelN; // type: DATA_WORD length: 0x0 offset: 0xac
			[FieldOffset(0xae)] short LevelH; // type: DATA_WORD length: 0x0 offset: 0xae
			[FieldOffset(0xb0)] short MinHP; // type: DATA_WORD length: 0x0 offset: 0xb0
			[FieldOffset(0xb2)] short MinHPN; // type: DATA_WORD length: 0x0 offset: 0xb2
			[FieldOffset(0xb4)] short MinHPH; // type: DATA_WORD length: 0x0 offset: 0xb4
			[FieldOffset(0xb6)] short MaxHP; // type: DATA_WORD length: 0x0 offset: 0xb6
			[FieldOffset(0xb8)] short MaxHPN; // type: DATA_WORD length: 0x0 offset: 0xb8
			[FieldOffset(0xba)] short MaxHPH; // type: DATA_WORD length: 0x0 offset: 0xba
			[FieldOffset(0xbc)] short AC; // type: DATA_WORD length: 0x0 offset: 0xbc
			[FieldOffset(0xbe)] short ACN; // type: DATA_WORD length: 0x0 offset: 0xbe
			[FieldOffset(0xc0)] short ACH; // type: DATA_WORD length: 0x0 offset: 0xc0
			[FieldOffset(0xc2)] short A1TH; // type: DATA_WORD length: 0x0 offset: 0xc2
			[FieldOffset(0xc4)] short A1THN; // type: DATA_WORD length: 0x0 offset: 0xc4
			[FieldOffset(0xc6)] short A1THH; // type: DATA_WORD length: 0x0 offset: 0xc6
			[FieldOffset(0xc8)] short A2TH; // type: DATA_WORD length: 0x0 offset: 0xc8
			[FieldOffset(0xca)] short A2THN; // type: DATA_WORD length: 0x0 offset: 0xca
			[FieldOffset(0xcc)] short A2THH; // type: DATA_WORD length: 0x0 offset: 0xcc
			[FieldOffset(0xce)] short S1TH; // type: DATA_WORD length: 0x0 offset: 0xce
			[FieldOffset(0xd0)] short S1THN; // type: DATA_WORD length: 0x0 offset: 0xd0
			[FieldOffset(0xd2)] short S1THH; // type: DATA_WORD length: 0x0 offset: 0xd2
			[FieldOffset(0xd4)] short Exp; // type: DATA_WORD length: 0x0 offset: 0xd4
			[FieldOffset(0xd6)] short ExpN; // type: DATA_WORD length: 0x0 offset: 0xd6
			[FieldOffset(0xd8)] short ExpH; // type: DATA_WORD length: 0x0 offset: 0xd8
			[FieldOffset(0xda)] short A1MinD; // type: DATA_WORD length: 0x0 offset: 0xda
			[FieldOffset(0xdc)] short A1MinDN; // type: DATA_WORD length: 0x0 offset: 0xdc
			[FieldOffset(0xde)] short A1MinDH; // type: DATA_WORD length: 0x0 offset: 0xde
			[FieldOffset(0xe0)] short A1MaxD; // type: DATA_WORD length: 0x0 offset: 0xe0
			[FieldOffset(0xe2)] short A1MaxDN; // type: DATA_WORD length: 0x0 offset: 0xe2
			[FieldOffset(0xe4)] short A1MaxDH; // type: DATA_WORD length: 0x0 offset: 0xe4
			[FieldOffset(0xe6)] short A2MinD; // type: DATA_WORD length: 0x0 offset: 0xe6
			[FieldOffset(0xe8)] short A2MinDN; // type: DATA_WORD length: 0x0 offset: 0xe8
			[FieldOffset(0xea)] short A2MinDH; // type: DATA_WORD length: 0x0 offset: 0xea
			[FieldOffset(0xec)] short A2MaxD; // type: DATA_WORD length: 0x0 offset: 0xec
			[FieldOffset(0xee)] short A2MaxDN; // type: DATA_WORD length: 0x0 offset: 0xee
			[FieldOffset(0xf0)] short A2MaxDH; // type: DATA_WORD length: 0x0 offset: 0xf0
			[FieldOffset(0xf2)] short S1MinD; // type: DATA_WORD length: 0x0 offset: 0xf2
			[FieldOffset(0xf4)] short S1MinDN; // type: DATA_WORD length: 0x0 offset: 0xf4
			[FieldOffset(0xf6)] short S1MinDH; // type: DATA_WORD length: 0x0 offset: 0xf6
			[FieldOffset(0xf8)] short S1MaxD; // type: DATA_WORD length: 0x0 offset: 0xf8
			[FieldOffset(0xfa)] short S1MaxDN; // type: DATA_WORD length: 0x0 offset: 0xfa
			[FieldOffset(0xfc)] short S1MaxDH; // type: DATA_WORD length: 0x0 offset: 0xfc
			[FieldOffset(0xfe)] byte El1Mode; // type: CODE_TO_BYTE length: 0x0 offset: 0xfe
			[FieldOffset(0xff)] byte El2Mode; // type: CODE_TO_BYTE length: 0x0 offset: 0xff
			[FieldOffset(0x100)] byte El3Mode; // type: CODE_TO_BYTE length: 0x0 offset: 0x100
			[FieldOffset(0x101)] byte El1Type; // type: CODE_TO_BYTE length: 0x0 offset: 0x101
			[FieldOffset(0x102)] byte El2Type; // type: CODE_TO_BYTE length: 0x0 offset: 0x102
			[FieldOffset(0x103)] byte El3Type; // type: CODE_TO_BYTE length: 0x0 offset: 0x103
			[FieldOffset(0x104)] byte El1Pct; // type: DATA_BYTE length: 0x0 offset: 0x104
			[FieldOffset(0x105)] byte El1PctN; // type: DATA_BYTE length: 0x0 offset: 0x105
			[FieldOffset(0x106)] byte El1PctH; // type: DATA_BYTE length: 0x0 offset: 0x106
			[FieldOffset(0x107)] byte El2Pct; // type: DATA_BYTE length: 0x0 offset: 0x107
			[FieldOffset(0x108)] byte El2PctN; // type: DATA_BYTE length: 0x0 offset: 0x108
			[FieldOffset(0x109)] byte El2PctH; // type: DATA_BYTE length: 0x0 offset: 0x109
			[FieldOffset(0x10a)] byte El3Pct; // type: DATA_BYTE length: 0x0 offset: 0x10a
			[FieldOffset(0x10b)] byte El3PctN; // type: DATA_BYTE length: 0x0 offset: 0x10b
			[FieldOffset(0x10c)] byte El3PctH; // type: DATA_BYTE length: 0x0 offset: 0x10c
			[FieldOffset(0x10e)] short El1MinD; // type: DATA_WORD length: 0x0 offset: 0x10e
			[FieldOffset(0x110)] short El1MinDN; // type: DATA_WORD length: 0x0 offset: 0x110
			[FieldOffset(0x112)] short El1MinDH; // type: DATA_WORD length: 0x0 offset: 0x112
			[FieldOffset(0x114)] short El2MinD; // type: DATA_WORD length: 0x0 offset: 0x114
			[FieldOffset(0x116)] short El2MinDN; // type: DATA_WORD length: 0x0 offset: 0x116
			[FieldOffset(0x118)] short El2MinDH; // type: DATA_WORD length: 0x0 offset: 0x118
			[FieldOffset(0x11a)] short El3MinD; // type: DATA_WORD length: 0x0 offset: 0x11a
			[FieldOffset(0x11c)] short El3MinDN; // type: DATA_WORD length: 0x0 offset: 0x11c
			[FieldOffset(0x11e)] short El3MinDH; // type: DATA_WORD length: 0x0 offset: 0x11e
			[FieldOffset(0x120)] short El1MaxD; // type: DATA_WORD length: 0x0 offset: 0x120
			[FieldOffset(0x122)] short El1MaxDN; // type: DATA_WORD length: 0x0 offset: 0x122
			[FieldOffset(0x124)] short El1MaxDH; // type: DATA_WORD length: 0x0 offset: 0x124
			[FieldOffset(0x126)] short El2MaxD; // type: DATA_WORD length: 0x0 offset: 0x126
			[FieldOffset(0x128)] short El2MaxDN; // type: DATA_WORD length: 0x0 offset: 0x128
			[FieldOffset(0x12a)] short El2MaxDH; // type: DATA_WORD length: 0x0 offset: 0x12a
			[FieldOffset(0x12c)] short El3MaxD; // type: DATA_WORD length: 0x0 offset: 0x12c
			[FieldOffset(0x12e)] short El3MaxDN; // type: DATA_WORD length: 0x0 offset: 0x12e
			[FieldOffset(0x130)] short El3MaxDH; // type: DATA_WORD length: 0x0 offset: 0x130
			[FieldOffset(0x132)] short El1Dur; // type: DATA_WORD length: 0x0 offset: 0x132
			[FieldOffset(0x134)] short El1DurN; // type: DATA_WORD length: 0x0 offset: 0x134
			[FieldOffset(0x136)] short El1DurH; // type: DATA_WORD length: 0x0 offset: 0x136
			[FieldOffset(0x138)] short El2Dur; // type: DATA_WORD length: 0x0 offset: 0x138
			[FieldOffset(0x13a)] short El2DurN; // type: DATA_WORD length: 0x0 offset: 0x13a
			[FieldOffset(0x13c)] short El2DurH; // type: DATA_WORD length: 0x0 offset: 0x13c
			[FieldOffset(0x13e)] short El3Dur; // type: DATA_WORD length: 0x0 offset: 0x13e
			[FieldOffset(0x140)] short El3DurN; // type: DATA_WORD length: 0x0 offset: 0x140
			[FieldOffset(0x142)] short El3DurH; // type: DATA_WORD length: 0x0 offset: 0x142
			[FieldOffset(0x144)] short ResDm; // type: DATA_WORD length: 0x0 offset: 0x144
			[FieldOffset(0x146)] short ResDmN; // type: DATA_WORD length: 0x0 offset: 0x146
			[FieldOffset(0x148)] short ResDmH; // type: DATA_WORD length: 0x0 offset: 0x148
			[FieldOffset(0x14a)] short ResMa; // type: DATA_WORD length: 0x0 offset: 0x14a
			[FieldOffset(0x14c)] short ResMaN; // type: DATA_WORD length: 0x0 offset: 0x14c
			[FieldOffset(0x14e)] short ResMaH; // type: DATA_WORD length: 0x0 offset: 0x14e
			[FieldOffset(0x150)] short ResFi; // type: DATA_WORD length: 0x0 offset: 0x150
			[FieldOffset(0x152)] short ResFiN; // type: DATA_WORD length: 0x0 offset: 0x152
			[FieldOffset(0x154)] short ResFiH; // type: DATA_WORD length: 0x0 offset: 0x154
			[FieldOffset(0x156)] short ResLi; // type: DATA_WORD length: 0x0 offset: 0x156
			[FieldOffset(0x158)] short ResLiN; // type: DATA_WORD length: 0x0 offset: 0x158
			[FieldOffset(0x15a)] short ResLiH; // type: DATA_WORD length: 0x0 offset: 0x15a
			[FieldOffset(0x15c)] short ResCo; // type: DATA_WORD length: 0x0 offset: 0x15c
			[FieldOffset(0x15e)] short ResCoN; // type: DATA_WORD length: 0x0 offset: 0x15e
			[FieldOffset(0x160)] short ResCoH; // type: DATA_WORD length: 0x0 offset: 0x160
			[FieldOffset(0x162)] short ResPo; // type: DATA_WORD length: 0x0 offset: 0x162
			[FieldOffset(0x164)] short ResPoN; // type: DATA_WORD length: 0x0 offset: 0x164
			[FieldOffset(0x166)] short ResPoH; // type: DATA_WORD length: 0x0 offset: 0x166
			[FieldOffset(0x168)] byte ColdEffect; // type: DATA_BYTE length: 0x0 offset: 0x168
			[FieldOffset(0x169)] byte ColdEffectN; // type: DATA_BYTE length: 0x0 offset: 0x169
			[FieldOffset(0x16a)] byte ColdEffectH; // type: DATA_BYTE length: 0x0 offset: 0x16a
			[FieldOffset(0x16c)] uint SendSkills; // type: DATA_DWORD_2 length: 0x0 offset: 0x16c
			[FieldOffset(0x170)] short Skill1; // type: NAME_TO_WORD length: 0x0 offset: 0x170
			[FieldOffset(0x172)] short Skill2; // type: NAME_TO_WORD length: 0x0 offset: 0x172
			[FieldOffset(0x174)] short Skill3; // type: NAME_TO_WORD length: 0x0 offset: 0x174
			[FieldOffset(0x176)] short Skill4; // type: NAME_TO_WORD length: 0x0 offset: 0x176
			[FieldOffset(0x178)] short Skill5; // type: NAME_TO_WORD length: 0x0 offset: 0x178
			[FieldOffset(0x17a)] short Skill6; // type: NAME_TO_WORD length: 0x0 offset: 0x17a
			[FieldOffset(0x17c)] short Skill7; // type: NAME_TO_WORD length: 0x0 offset: 0x17c
			[FieldOffset(0x17e)] short Skill8; // type: NAME_TO_WORD length: 0x0 offset: 0x17e
			[FieldOffset(0x198)] byte Sk1lvl; // type: DATA_BYTE length: 0x0 offset: 0x198
			[FieldOffset(0x199)] byte Sk2lvl; // type: DATA_BYTE length: 0x0 offset: 0x199
			[FieldOffset(0x19a)] byte Sk3lvl; // type: DATA_BYTE length: 0x0 offset: 0x19a
			[FieldOffset(0x19b)] byte Sk4lvl; // type: DATA_BYTE length: 0x0 offset: 0x19b
			[FieldOffset(0x19c)] byte Sk5lvl; // type: DATA_BYTE length: 0x0 offset: 0x19c
			[FieldOffset(0x19d)] byte Sk6lvl; // type: DATA_BYTE length: 0x0 offset: 0x19d
			[FieldOffset(0x19e)] byte Sk7lvl; // type: DATA_BYTE length: 0x0 offset: 0x19e
			[FieldOffset(0x19f)] byte Sk8lvl; // type: DATA_BYTE length: 0x0 offset: 0x19f
			[FieldOffset(0x1a0)] uint DamageRegen; // type: DATA_DWORD length: 0x0 offset: 0x1a0
			[FieldOffset(0x1a4)] byte SplEndDeath; // type: DATA_BYTE length: 0x0 offset: 0x1a4
			[FieldOffset(0x1a5)] byte SplGetModeChart; // type: DATA_BYTE length: 0x0 offset: 0x1a5
			[FieldOffset(0x1a6)] byte SplEndGeneric; // type: DATA_BYTE length: 0x0 offset: 0x1a6
			[FieldOffset(0x1a7)] byte SplClientEnd; // type: DATA_BYTE length: 0x0 offset: 0x1a7
			[FieldOffset(0x1a8)] byte end; // type: END length: 0x0 offset: 0x1a8
		}
	}
	#endregion

	#region unnecessary
	[StructLayout(LayoutKind.Sequential)]
	public struct SkillDescTable
	{
		short skilldesc; // type: NAME_TO_INDEX length: 0x0 offset: 0x0
		byte skillpage; // type: DATA_BYTE length: 0x0 offset: 0x2
		byte skillrow; // type: DATA_BYTE length: 0x0 offset: 0x3
		byte skillcolumn; // type: DATA_BYTE length: 0x0 offset: 0x4
		byte ListRow; // type: DATA_BYTE length: 0x0 offset: 0x5
		byte ListPool; // type: DATA_BYTE length: 0x0 offset: 0x6
		byte iconcel; // type: DATA_BYTE length: 0x0 offset: 0x7
		short strName; // type: KEY_TO_WORD length: 0x0 offset: 0x8
		short strShort; // type: KEY_TO_WORD length: 0x0 offset: 0xa
		short strLong; // type: KEY_TO_WORD length: 0x0 offset: 0xc
		short strAlt; // type: KEY_TO_WORD length: 0x0 offset: 0xe
		short strMana; // type: KEY_TO_WORD length: 0x0 offset: 0x10
		short descdam; // type: DATA_WORD length: 0x0 offset: 0x12
